object Channels {
    private val channelsSet = setOf(
        "Первый канал", "Россия 1", "МАТЧ!", "НТВ", "ТВ Центр", "Культура", "СТС", "РЕН ТВ", "Телепутешествия",
        "ТНТ", "Dомашний", "Россия 24", "Че", "ТВ-3", "Пятница!", "Ю", "Суббота!"," Звезда", "2x2", "МИР", "ОТР",
        "Спас ТВ", "Дом Кино", "TV1000", "Мосфильм. Золотая коллекция", "TV1000 Action", "TV1000 World kino",
        "TV1000 Русское кино", "Кино ТВ", "Русский Детектив", "Комедия", "Русский роман", "Иллюзион +", "Доктор",
        "Русский Иллюзион", "FOX", "Paramount Comedy Russia", "СТС Love", "TV XXI", "А2", "Камеди", "360TV",
        "Наше новое кино", "Кинокомедия", "Кинопоказ", "Индийское кино", "RTVi Архив", "Кинохит", "Кинопремьера",
        "Мужское кино", "Советское кино", "Дорама", "Победа", "sci-fi", "Любимое кино", "KINO24", "Блокбастер", "Хит",
        "Мир сериала", "Калейдоскоп ТВ", "Открытый мир", "Любимое.ТВ", "ТВТУР", "Время", "Пес и Кот", "Классика Кино",
        "Неизвестная Планета", "Ратник", "Большая Азия", "TVRUS", "7 TV", "Телеканал КХЛ", "МАТЧ! Боец", "МАТЧ! Арена",
        "Viasat Sport", "Футбол", "Мир Баскетбола", "Старт", "Бокс ТВ", "Удар", "МИР 24", "РБК", "Известия", "CNBC",
        "NHK WORLD", "Bloomberg", "Russia Today Documentary", "Al JaZeera", "Russia Today", "Хабар 24", "5 канал",
        "Москва-24", "Орбита", "Продвижение", "Крик ТВ", "ACB TV", "H1", "Animal Planet", "Discovery Science",
        "Моя Планета", "History", "Viasat History", "Viasat Nature", "Viasat Explore", "National Geographic Wild",
        "National Geographic", "Психология 21", "Кто есть кто", "365 дней ТВ", "Совершенно секретно", "Ocean TV",
        "Вопросы и ответы", "Zooпарк", "Нано", "Наука", "Da Vinci", "Зоо ТВ", "Живая планета", "Просвещение",
        "Тайны галактики", "ЕГЭ ТВ", "История", "China TV", "Московский образовательный", "TV BRICS", "В мире животных",
        "MTV", "Rocks", "VH1", "Classic", "MTV Россия", "Наше ТВ", "MusicBox TV", "Русский Хит", "Музыка Первого",
        "Шансон-TB", "Ля-минор", "Мой музыкальный", "Mezzo", "ТНТ MUSIC", "RE:Music", "О2ТВ", "RAP.RU", "Classic Music",
        "Жар Птица", "Europa Plus TV", "МУЗ ТВ", "Мультимузыка", "Восток ТВ", "Ностальгия", "Диалоги о рыбалке",
        "Техно 24", "Русский Экстрим", "Fashion TV", "Outdoor Channel", "Оружие", "Театр", "Shop24", "Охота и рыбалка",
        "Russian Travel Guide", "CBS Reality", "Драйв", "ЕДА", "Усадьба", "Загородная жизнь", "Здоровое ТВ", "Жара",
        "Кухня ТВ", "E TV", "Авто Плюс", "ЖИВИ!", "Охотник и Рыболов", "Загородный", "Travel Channel",
        "Мужской Союз", "Телекафе", "English Club TV", "Моя стихия", "Motorsport.tv", "Конный мир", "Дикая рыбалка",
        "Travel+Adventure", "Мир Увлечений", "Авто 24", "Дикая охота", "Shopping Live", "Дайвинг.TV", "Foodman.club",
        "Вкусное TV", "Домашние животные", "Анекдот ТВ", "Первый вегетарианский", "Бобер", "Зал суда", "КВН ТВ",
        "Love Nature", "HGTV", "Home & Garden", "World Business Channel", "Карусель", "Disney", "СТС Kids", "Мульт",
        "Детский мир", "Радость Моя", "Baby TV", "Уникум", "Cartoon Network", "Nickelodeon", "Рыжий", "Карапуз ТВ",
        "Советские мультфильмы", "Смайлик ТВ", "Сказки Зайки", "Малыш ТВ", "О!", "NickToons", "В гостях у сказки"
    )

    fun getRandomChannels(): List<String> {
        return this.channelsSet.shuffled().subList(0, (1..218).random())
    }
}